Repository: mathessaricci/nasc
Catalog: po/extra/*.po
Languages: pt_br

source: Do maths like a normal person
pt_br: Faça matemática como uma pessoa normal

source: Calculator
pt_br: Calculadora

source: It’s an app where you do maths like a normal person. It lets you type whatever you want and smartly figures out what is math and spits out an answer on the right pane. Then you can plug those answers in to future equations and if that answer changes, so does the equations it’s used in.
pt_br: É um aplicativo onde você faz os seus cálculos como uma pessoa normal. Permite escrever o que você quiser e descobre, de forma inteligente, qual é o resultado do cálculo e exibe uma resposta no painel direito. Daí, você pode inserir essa resposta dentro de equações futuras e se a resposta mudar, também a equação que foi usada muda.

source: Build libqalculate as submodule - This means better calculation results and more functions
pt_br: O libqalculate foi construido como um submódulo - Isto significa resultados de cálculos mais precisos e mais funções

source: Added convert to different number bases. E.g. 16734003 to hex
pt_br: Adicionada conversão para diferentes bases numéricas. E.g. 16734003 to hex

source: Available number bases: hex bin dec oct duo roman bijective roman sexa fp32 fp64 fp16 fp80 fp128
pt_br: Bases numéricas disponíveis: hex bin dec oct duo roman bijective roman sexa fp3 fp64 fp16 fp80 fp128

source: Improved scroll behavior when using long equations or results
pt_br: Melhorado o comportamento de rolagem quando usa-se longas equações ou resultados

source: Ctrl + Shift + C copys result when nothing is marked in the input pane
pt_br: Ctrl + Shift + C copia o resultado quando não entrada marcada no painel

source: Right click on a result copies it to the clipboard
pt_br: Clique direito em um resultado copia-o para o clipboard

source: Auto complete functions with parenthesis
pt_br: Autocompletar funções com parênteses

source: Quit on Ctrl + Q
pt_br: Fechar com Ctrl + Q

source: Update desktop file.
pt_br: Atualizado o arquivo desktop

source: Fix double NaSC icon.
pt_br: Consertado o icone duplicado do NaSC

source: Fix linking of qalculatenasc lib.
pt_br: Consertado o link da qalculatenasc lib.

source: Update Debian control file.
pt_br: Atualização do arquivo Debian control

source: Release for Juno.
pt_br: Lançamento para Juno

source: Main view
pt_br: Visão principal

source: Help pane
pt_br: Painel de ajuda

source: Periodic table
pt_br: Tabela Periódica
